day05/01hagenPoiseuilleFlow/laminar_pipe/case0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1890;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1990;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       2000;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       2010;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1000;
        startFace       2110;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1000;
        startFace       3110;
    }
)

// ************************************************************************* //
