day05/01hagenPoiseuilleFlow/laminar_pipe/case0/system/modifyMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      modifyMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Move boundary points:
// Every entry is two coordinates. First one is location of the point to move,
// the second is the position to move to.
pointsToMove
(
/*
    ((8 0 0.1)(8 0.05 0.1))
    ((8 0 0)(8 0.05 0))
*/

    ((8 0 0.1)(8.098 0.085 0.1))
    ((8 0 0)(8.098 0.085 0))

/*
    ((8 0 0.1)(8 0.11 0.1))
    ((8 0 0)(8 0.11 0))
*/

/*
    ((9.9 0 0.1)(9.9 0.11 0.1))
    ((9.9 0 0)(9.9 0.11 0))
*/
);

edgesToSplit
(

);

facesToTriangulate
(

);

edgesToCollapse
(

);

cellsToSplit
(

);

facesToRepatch
(

);

// ************************************************************************* //
